wmy2370cn/nxp-lpc/trunk/NXP-LPC/RT-Thread/bsp/lpc2468/nic_bsp.c
	return (clk_freq);
}
 
void rt_delayms(INT32U ms)
{
	//执行11059200次语句，花时3.570S，差不多每ms计算3097条语句
	INT32U count=3339*ms;
	INT32U i;
	for (i=0;i<count;i++)
	{
		__asm{ NOP };
	}
}


void  nic_int_init  (void)
{
	//	rt_hw_interrupt_install(VIC_ETHERNET, nic_isr_handler, RT_NULL);
	//	rt_hw_interrupt_umask(VIC_ETHERNET);

	VICIntSelect       &= ~(1 << VIC_ETHERNET);                         /* Configure the Ethernet VIC interrupt source for IRQ      */
	VICVectAddr21       =  (INT32U)nic_isr_handler;              /* Set the vector address                                   */
	VICIntEnable        =  (1 << VIC_ETHERNET);                         /* Enable the VIC interrupt source, but no local sources    */
}

/* RT-Thread Device Interface */
 
#define  MAIN_OSC_FRQ              11059200L
#define  IRC_OSC_FRQ               11059200L
#define  RTC_OSC_FRQ                  32768L


rt_uint32_t  BSP_CPU_ClkFreq (void)
{
	rt_uint32_t  msel;
	rt_uint32_t  nsel;
	rt_uint32_t  fin;
	rt_uint32_t  pll_clk_feq;                                    /* When the PLL is enabled, this is Fcco                    */
	rt_uint32_t  clk_div;
	rt_uint32_t  clk_freq;

	switch (CLKSRCSEL & 0x03)
	{                                 /* Determine the current clock source                       */
		case 0:
			fin        =  IRC_OSC_FRQ;
			break;
		case 1:
			fin        =  MAIN_OSC_FRQ;
			break;
		case 2:
			fin        =  RTC_OSC_FRQ;
			break;
		default:
			fin        =  IRC_OSC_FRQ;
			break;
	}

	if ((PLLSTAT & (1 << 25)) > 0) 
	{                                                              /* If the PLL is currently enabled and connected        */
		msel        = (rt_uint32_t)(PLLSTAT & 0x3FFF) + 1;           /* Obtain the PLL multiplier                            */
		nsel        = (rt_uint32_t)((PLLSTAT >>   16) & 0x0F) + 1;   /* Obtain the PLL divider                               */
		pll_clk_feq = (2 * msel * fin / nsel);                      /* Compute the PLL output frequency                     */
	} 
	else
	{
		pll_clk_feq = (fin);                                        /* The PLL is bypassed                                  */
	}

	clk_div         = (rt_uint8_t)(CCLKCFG & 0x0F) + 1;             /* Obtain the CPU core clock divider                    */
	clk_freq        = (rt_uint32_t)(pll_clk_feq / clk_div);          /* Compute the ARM Core clock frequency                 */

	return (clk_freq);
}
  
static rt_err_t rt_lpc24xxether_open(rt_device_t dev, rt_uint16_t oflag)
{
	return RT_EOK;
}

static rt_err_t rt_lpc24xxether_close(rt_device_t dev)
{
	return RT_EOK;
}

static rt_size_t rt_lpc24xxether_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
	return 0;
}

static rt_size_t rt_lpc24xxether_write (rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
	rt_set_errno(-RT_ENOSYS);
	return 0;
}
 
static rt_err_t rt_lpc24xxether_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
	switch(cmd)
	{
	case NIOCTL_GADDR:
		/* get mac address */
		if(args) rt_memcpy(args, lpc24xx_device.dev_addr, 6);
		else return -RT_ERROR;
		break;

	default :
		break;
	}

	return RT_EOK;
}
 

#define   MIN(x, y)   ((x)   >   (y)   ?   (y)   :   (x)) 
void lpc24xxether_write_frame( struct pbuf* p )
{
	struct pbuf* q;
	INT8U *pDescBuf = NULL;
	INT8U *pSrcBuf = NULL;
	INT16U nTxBufOffset = 0,nDescOffset = 0,nPduLen = 0,nSendLen = 0;

	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (p == NULL)
		return ;
 
	pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;

	for (q = p; q != NULL; q = q->next)
	{
		nTxBufOffset = 0;
		if (q && q->len)
		{
			pSrcBuf = (INT8U*) q->payload;

			while( nTxBufOffset < q->len )
			{
				nPduLen = MIN(ETH_FRAG_SIZE-nDescOffset,q->len-nTxBufOffset);
				if (nPduLen)
				{
					memcpy(&pDescBuf[nDescOffset], &pSrcBuf[nTxBufOffset], nPduLen );
					nSendLen += nPduLen;

					if (nSendLen >= p->tot_len)
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}
					else
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}

					nTxBufOffset += nPduLen;
					nDescOffset += nPduLen;
				
					//更新
					if (nDescOffset >= ETH_FRAG_SIZE )
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;
					}
					else if (nSendLen >= p->tot_len)
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						break;
					}
				}
			}
		}							   
	}
	MAC_TXPRODUCEINDEX = TxProduceIndex;
}
/*
* Transmit packet.
*/ 
 
rt_err_t lpc24xxether_tx( rt_device_t dev, struct pbuf* p)
{
	/* lock tx operation */
//	rt_sem_take(&tx_sem, RT_WAITING_FOREVER);
	rt_sem_take(&tx_sem, RT_WAITING_FOREVER);

//	OSSemPend(tx_sem,0,&err);
	lpc24xxether_write_frame (p);
//	OSSemPost(tx_sem);
	rt_sem_release(&tx_sem);

